Autodesk.Revit.DB.Structure.SurfaceElementProjectionZ
Presets for given Analytical Projection Z.

Autodesk.Revit.DB.Structure.SurfaceElementProjectionZ.Plane
Use a Plane for projection (e.g., Grid, Level).

Autodesk.Revit.DB.Structure.SurfaceElementProjectionZ.CenterOfCore
Center of core.
Applicable for wall analytical model only.

Autodesk.Revit.DB.Structure.SurfaceElementProjectionZ.BottomOrExterior
Bottom for floor or Exterior Face for wall element.

Autodesk.Revit.DB.Structure.SurfaceElementProjectionZ.CenterOfElement
Center of element.

Autodesk.Revit.DB.Structure.SurfaceElementProjectionZ.TopOrInterior
Top for floor or Interior Face for wall element.